[{
  "name": "The Full Stack Developer: Your Essential Guide to the Everyday Skills Expected of a Modern Full Stack Web Developer",
  "type": "Paperback",
  "author": "Chris Northwood",
  "category": "Full Stack Developer",
  "price": "3136",
  "image": "/images/img1.jpg",
  "description": "Understand the technical foundations, as well as the non-programming skills needed to be a successful full stack web developer. This book reveals the reasons why a truly successful full stack developer does more than write code. ",
  "countInStock": "7",
  "numReviews": 0,
  "rating": 0
},{
  "name": "Pro MERN Stack: Full Stack Web App Development with Mongo, Express, React, and Node",
  "type": "Paperback",
  "author": "Vasan Subramanian",
  "category": "Full Stack Developer",
  "price": "4069",
  "image": "/images/img2.jpg",
  "description": "Assemble the complete stack required to build a modern web app using MongoDB, Express, React, and Node. This book also covers many other complementary tools: React Router, GraphQL, React-Bootstrap, Babel, and Webpack. This new edition will use the latest version of React (React 16) and the latest React Router (React Router 4), which has a significantly different approach to routing compared to React Router 2 which was used in the first edition of the book.",
  "countInStock": "8",
  "numReviews": 0,
  "rating": 0
},{
  "name": "The Road to Learn React: Your Journey to Master Plain Yet Pragmatic React.Js",
  "type": "Paperback",
  "author": "Robin Wieruch",
  "category": "ReactJS",
  "price": "3110",
  "image": "/images/img3.jpg",
  "description": "The road to learn react teaches you the fundamentals of react. You will build a real world application along the way in plain react without complicated tooling. Everything from project setup to deployment on a server will be explained. ",
  "countInStock": "5",
  "numReviews": 0,
  "rating": 0
},{
  "name": "React js: Hands-On full stack web development using React js, 2nd Edition",
  "type": "Paperback",
  "author": "Susan Fitzgerald",
  "category": "ReactJS",
  "price": "2053",
  "image": "/images/img4.jpg",
  "description": "Facebook's React has changed the way we think about web applications and user interface development. Due to its design, you can use it beyond web. A feature known as the Virtual DOM enables this.In this chapter we'll go through some of the basic ideas behind the library so you understand React a little better before moving on.",
  "countInStock": "10",
  "numReviews": 0,
  "rating": 0
},{
  "name": "Mastering Node.js",
  "type": "HardCover",
  "author": "Sandro Pasquali",
  "category": "NodeJS",
  "price": " 2899",
  "image": "/images/img5.jpg",
  "description": "Expert techniques for building fast servers and scalable, real-time network applications with minimal effort; rewritten for Node.js 8 and Node.js 9 About This Book is packed with practical examples and explanations, Mastering Node.js contains everything you need to take your applications to the next level.",
  "countInStock": "6",
  "numReviews": 0,
  "rating": 0
},{
  "name": "Node.js in Action",
  "type": "Paperback",
  "author": "ALex Young",
  "category": "NodeJS",
  "price": "899",
  "image": "/images/img6.jpg",
  "description": "The first edition of Node.js in Action was about web development with a particular focus on the Connect and Express web frameworks. Node.js in Action, Second Edition has been updated to suit the changing requirements of Node development. You’ll learn about front-end build systems, popular Node web frameworks and how to build a web application with Express from scratch. ",
  "countInStock": "8",
  "numReviews": 0,
  "rating": 0
},{
  "name": "NODE.JS Guidebook",
  "type": "Paperback",
  "author": "Dhruthi Shah",
  "category": "NodeJS",
  "price": "324",
  "image": "/images/img7.jpg",
  "description": "Node.Js guidebook aims to introduce readers to the world of Node.Js. Node.Js is an open source JavaScript run-time environment that executes JavaScript on server-side. Earlier, JavaScript was used only for client-side scripting, but Node.Js supports the creation of dynamic web applications by using JavaScript for server-side scripting.",
  "countInStock": "0",
  "numReviews": 0,
  "rating": 0
},{
  "name": "JavaScript and JQuery: Interactive Front-End Web Development",
  "type": "Hardcover",
  "author": "Jon Duckett",
  "category": "JS",
  "price": "2163",
  "image": "/images/img8.jpg",
  "description": "This full-color book adopts a visual approach to teaching JavaScript & jQuery, showing you how to make web pages more interactive and interfaces more intuitive through the use of inspiring code examples, infographics, and photography. The content assumes no previous programming experience, other than knowing how to create a basic web page in HTML & CSS.",
  "countInStock": "5",
  "numReviews": 0,
  "rating": 0
},{
  "name": "Mastering HTML, CSS & RWD",
  "type": "HardCover",
  "author": "Laura Lemay",
  "category": "HTML,CSS & RWD",
  "price": "360",
  "image": "/images/img9.jpg",
  "description": "This book covers HTML5, CSS3 and jQuery… In just one hour a day, you’ll learn the skills you need to design, create and maintain a professional-looking website Thoroughly revised and updated with examples rewritten to conform to HTML5, CSS3 and contemporary web development practices",
  "countInStock": "9",
  "numReviews": 0,
  "rating": 0
},{
  "name": "HTML5 Black Book, Covers CSS 3, RWD",
  "type": "Paperback",
  "author": "DT Editorial Services",
  "category": "HTML,CSS & RWD",
  "price": "679",
  "image": "/images/img10.jpg",
  "description": "HTML5 Black Book is the one-time reference book, written from the Web professional’s point of view, containing hundreds of examples and covering nearly every aspect of HTML5. It will help you to master various Web technologies, other than HTML5, including CSS3, JavaScript, XML and AJAX.",
  "countInStock": "8",
  "numReviews": 0,
  "rating": 0
},{
  "name": "HTML5 & CSS3 For Beginners",
  "type": "Paperback",
  "author": "iCode Academy",
  "category": "HTML,CSS & RWD",
  "price": "1438",
  "image": "/images/img11.jpg",
  "description": "This book contains the steps, strategies, and information you need to learn HTML5 and CSS3, the latest and current standard languages for creating websites and designing web pages. It was conceptualised and developed to help beginners, business owners, and interested web users master the powerful features of these website creation and styling tools in as fast as one day.",
  "countInStock": "2",
  "numReviews": 1,
  "rating": 4
},{
  "name": "MongoDB: The Definitive Guide: Powerful and Scalable Data Storage",
  "type": "HardCover",
  "author": "Eoin Brazil",
  "category": "MongoDB",
  "price": "1425",
  "image": "/images/img12.jpg",
  "description": "Manage your data with a system designed to support modern application development. Updated for MongoDB 4.2, the third edition of this authoritative and accessible guide shows you the advantages of using document-oriented databases. ",
  "countInStock": "6",
  "numReviews": 1,
  "rating": 4
},{
  "name": "MongoDB Best Practices",
  "type": "Paperback",
  "author": "Hirako San",
  "category": "MongoDB",
  "price": "568",
  "image": "/images/img13.jpg",
  "description": "MongoDB has grown to become one of the most popular NoSQL database. The book covers topics ranging from database indexing, high availability with performance best practices, storage engines, and commonly used queries to read and update collections.",
  "countInStock": "0",
  "numReviews": 2,
  "rating": 3.5
},{
  "name": "MERN Quick Start Guide: Build web applications with MongoDB, Express.js, React, and Node",
  "type": "HardCover",
  "author": "Eddy Wilson Iriarte Koroliova",
  "category": "Full Stack Developer",
  "price": "1910",
  "image": "/images/img14.jpg",
  "description": "This book focuses on providing key tasks that can help you get started, learn, understand, and build full-stack web applications. It walks you through the process of installing all the requirements and project setup to build client-side React web applications, managing synchronous and asynchronous data flows with Redux, and building real-time web applications with Socket.IO, RESTful APIs, and other concepts. This book gives you practical and clear hands-on experience so you can begin building a full-stack MERN web application.",
  "countInStock": "1",
  "numReviews": 5,
  "rating": 1
}]